2023-02-02-reparar-el-grub.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>reparar el grub</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">02 feb 2023</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2023-02-02-reparar-el-grub.html"
          >reparar el grub</a
        >
      </h1>
      <p>Usar un LiveUSB para reinstalar el grub</p>

      <div id="outline-container-orgaf6a96a" class="outline-2">
        <h2 id="orgaf6a96a">
          # Una vez iniciado el LiveUSB, hay que localizar la particion donde
          esta instalado el grub.
        </h2>
        <div class="outline-text-2" id="text-orgaf6a96a">
          <pre class="example">
sudo fdisk -l
</pre
          >
          <p>#+END<sub>SRC</sub></p>
        </div>
      </div>

      <div id="outline-container-org4e9c330" class="outline-2">
        <h2 id="org4e9c330"># Montar la particion raiz</h2>
        <div class="outline-text-2" id="text-org4e9c330">
          <pre class="example">
sudo mount /dev/sda2 /mnt
</pre
          >
        </div>
      </div>

      <div id="outline-container-org316640d" class="outline-2">
        <h2 id="org316640d"># Montar el resto de los dispositivos:</h2>
        <div class="outline-text-2" id="text-org316640d">
          <pre class="example"></pre>
          <p>
            sudo mount &#x2013;bind /dev /mnt/dev sudo mount &#x2013;bind
            /dev/pts /mnt/dev/pts sudo mount &#x2013;bind /proc /mnt/proc sudo
            mount &#x2013;bind /sys /mnt/sys #+END<sub>SRC</sub>
          </p>
        </div>
      </div>

      <div id="outline-container-orgb7ea35e" class="outline-2">
        <h2 id="orgb7ea35e">
          # Acceder a la partición raiz del sistema original como root:
        </h2>
        <div class="outline-text-2" id="text-orgb7ea35e">
          <div class="org-src-container">
            <pre class="src src-#+END_SRC">
sudo chroot /mnt
</pre
            >
          </div>
        </div>
      </div>

      <div id="outline-container-orgec87335" class="outline-2">
        <h2 id="orgec87335"># Instalar el grub en el MRB:</h2>
        <div class="outline-text-2" id="text-orgec87335">
          <div class="org-src-container">
            <pre class="src src-END_SRC">
grub-install --boot-directory=/boot/ --recheck /dev/sda
</pre
            >
          </div>

          <p>
            Aqui no hay que especificar la partición solo el disco, en este caso
            /dev/sda.
          </p>
        </div>
      </div>

      <div id="outline-container-org1f77efd" class="outline-2">
        <h2 id="org1f77efd">
          # Reiniciar y una vez dentro del sistema original:
        </h2>
        <div class="outline-text-2" id="text-org1f77efd">
          <pre class="example">
sudo update-grub2
</pre
          >

          <p>y listo!</p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
